v1/services/data/request.xml

<?xml version="1.0" encoding="ISO-8859-1"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
<soapenv:Body>
<air:LowFareSearchReq TargetBranch="P7030029" AuthorizedBy="Chetan" xmlns:air="http://www.travelport.com/schema/air_v24_0" xmlns:com="http://www.travelport.com/schema/common_v24_0">
<com:BillingPointOfSaleInfo OriginApplication="UAPI" />
<air:SearchAirLeg>
<air:SearchOrigin>
<com:CityOrAirport Code="AMS" />
</air:SearchOrigin>
<air:SearchDestination><com:CityOrAirport Code="BER" /></air:SearchDestination><air:SearchDestination><com:CityOrAirport Code="BCN" /></air:SearchDestination><air:SearchDestination><com:CityOrAirport Code="LON" /></air:SearchDestination><air:SearchDestination><com:CityOrAirport Code="CPH" /></air:SearchDestination><air:SearchDestination><com:CityOrAirport Code="PAR" /></air:SearchDestination><air:SearchDestination><com:CityOrAirport Code="IST" /></air:SearchDestination>
<air:SearchDepTime PreferredTime="2015-04-24" />
</air:SearchAirLeg>
<air:SearchAirLeg><air:SearchOrigin><com:CityOrAirport Code="BER" /></air:SearchOrigin><air:SearchOrigin><com:CityOrAirport Code="BCN" /></air:SearchOrigin><air:SearchOrigin><com:CityOrAirport Code="LON" /></air:SearchOrigin><air:SearchOrigin><com:CityOrAirport Code="CPH" /></air:SearchOrigin><air:SearchOrigin><com:CityOrAirport Code="PAR" /></air:SearchOrigin><air:SearchOrigin><com:CityOrAirport Code="IST" /></air:SearchOrigin><air:SearchDestination><com:CityOrAirport Code="AMS" /></air:SearchDestination><air:SearchDepTime PreferredTime="2015-04-26" /></air:SearchAirLeg>
<air:AirSearchModifiers>
<air:PreferredProviders>
<com:Provider Code="1G" />
<com:Provider Code="ACH" />
</air:PreferredProviders>
</air:AirSearchModifiers>
<com:SearchPassenger Code="ADT" />
</air:LowFareSearchReq>
</soapenv:Body>
</soapenv:Envelope>